example-scripts/bash-scripts/full-harvest-examples/1.0-1.5-examples/example-wos/wos-search-message.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:ns2="http://auth.cxf.wokmws.thomsonreuters.com">
	<soap:Body>
		<ns2:search>
			<queryParamters>
				<databaseID>WOS</databaseID>
					<editions>
						<collection>WOS</collection>
						<edition>CCR</edition>
					</editions>
				<queryLanguage>en</queryLanguage>
			<timeSpan>
				<begin>1993-01-01</begin>
				<end>2007-12-31</end>
			</timeSpan>
			</queryParamters>
			<retrieveParameters>
				<count>5</count>
				<fields>
					<name>Date</name>
					<sort>D</sort>
				</fields>
				<fields>
					<name>Relevance</name>
					<sort>D</sort>
				</fields>
				<firstRecord>1</firstRecord>
			</retrieveParameters>
		</ns2:search>
	</soap:Body>
</soap:Envelope>
